In [1]:
#importing libraries
import numpy as np
import pandas as pd

# Reading data from Excel sheet

In [3]:
#Reading data from Excel sheet
data1 = pd.read_excel(r'D:\Sample Datasets\Raw_data.xlsx')
data1

                                           Addr       Date     Name     Time
0  78 rd, kenith street, btm, bangalore, 500038 2022-04-03  Lavanya  8:45:23
1   45 rd,  maruthi street, hitech, Hyd, 500058 2022-06-07    Ramya  5:25:21
2     3 rd, royal street, Kondapur, Hyd, 500011 2022-08-09    Sudha  5:34:43

# Readig data from HTML file which has 1 table

- df's will be a list of DataFrames, each representing a table found in the HTML
- If there's only one table in the HTML file, you can access the first table as below:

In [5]:
#Readig data from HTML file which has 1 table
dfs = pd.read_html(r'D:\Sample Datasets\index.html')
data2 = dfs[0]
data2

      Name  Age         City
0    Alice   30     New York
1      Bob   25  Los Angeles
2  Charlie   35      Chicago

# Readig data from HTML file which has 2 tables or more

In [7]:
#Readig data from HTML file which has 2 tables
df = pd.read_html(r'D:\Sample Datasets\index_2.html')

data_employees = df[0]
data_products = df[1]

# Display the first DataFrame (Employees table)
print("Employees Table:")
print(data_employees)

# Display the second DataFrame (Products table)
print("\nProducts Table:")
print(data_products)

Employees Table:
  Employee Name   Department   Salary
0         Alice  Engineering  $80,000
1           Bob    Marketing  $60,000
2       Charlie           HR  $50,000

Products Table:
  Product Name   Price  Stock
0       Laptop  $1,200     50
1   Smartphone    $800    150
2   Headphones    $150    200

# Extracting more than 1 table from PDF using tabula-py

In [9]:
!pip -qqq install tabula-py

In [10]:
import pandas as pd
from tabula import read_pdf

In [28]:
path = "https://sedl.org/afterschool/toolkits/science/pdf/ast_sci_data_tables_sample.pdf"
table_data = read_pdf(path, pages='all',multiple_tables=True)

In [12]:
table_data

[   Number of Coils Number of Paperclips
 0                5              3, 5, 4
 1               10              7, 8, 6
 2               15           11, 10, 12
 3               20           15, 13, 14,
     Speed (mph)           Driver                         Car     Engine  \
 0       407.447  Craig Breedlove           Spirit of America     GE J47
 1       413.199        Tom Green            Wingfoot Express     WE J46
 2       434.220       Art Arfons               Green Monster     GE J79
 3       468.719  Craig Breedlove           Spirit of America     GE J79
 4       526.277  Craig Breedlove           Spirit of America     GE J79
 5       536.712       Art Arfons               Green Monster     GE J79
 6       555.127  Craig Breedlove  Spirit of America, Sonic 1     GE J79
 7       576.553       Art Arfons               Green Monster     GE J79
 8       600.601  Craig Breedlove  Spirit of America, Sonic 1     GE J79
 9       622.407    Gary Gabelich                  Blue Flame     Rocket
 10      633.468    Richard Noble                    Thrust 2  RR RG 146
 11      763.035       Andy Green                  Thrust SSC    RR Spey

         Date
 0     8/5/63
 1    10/2/64
 2    10/5/64
 3   10/13/64
 4   10/15/65
 5   10/27/65
 6    11/2/65
 7    11/7/65
 8   11/15/65
 9   10/23/70
 10   10/4/83
 11  10/15/97  ,
    Time (drops of water)  Distance (cm)
 0                      1        10,11,9
 1                      2     29, 31, 30
 2                      3     59, 58, 61
 3                      4   102, 100, 98
 4                      5  122, 125, 127]

In [13]:
table_data[0].head()

   Number of Coils Number of Paperclips
0                5              3, 5, 4
1               10              7, 8, 6
2               15           11, 10, 12
3               20           15, 13, 14

In [14]:
table_data[1].head()

   Speed (mph)           Driver                Car  Engine      Date
0      407.447  Craig Breedlove  Spirit of America  GE J47    8/5/63
1      413.199        Tom Green   Wingfoot Express  WE J46   10/2/64
2      434.220       Art Arfons      Green Monster  GE J79   10/5/64
3      468.719  Craig Breedlove  Spirit of America  GE J79  10/13/64
4      526.277  Craig Breedlove  Spirit of America  GE J79  10/15/65

In [15]:
table_data[2].head()

   Time (drops of water)  Distance (cm)
0                      1        10,11,9
1                      2     29, 31, 30
2                      3     59, 58, 61
3                      4   102, 100, 98
4                      5  122, 125, 127